[
    {
      "program_name": "Bachelor of Advanced Computer Science (Honours)",
      "uac_code": "425805",
      "duration_years": 4,
      "lowest_selection_rank": 96.0,
      "lowest_atar": 85.75,
      "portfolio_available": false,
      "assumed_knowledge": "Mathematics Extension 1",
      "description": "Use your advanced analytical skills to research and design the technologies of the future. Establish a solid foundation in programming, software engineering, data structure and algorithms. Additionally, gain specialised knowledge through advanced computing electives and an honours thesis that opens the door to higher degree research.",
      "career_outcomes": "Chief technology officer, Consultant, Database developer, Game programmer, Researcher, Security researcher, Software engineer, Systems analyst",
      "majors": [
        "Computer Science",
        "Security Engineering",
        "Artificial Intelligence"
      ],
      "minors": ["Mathematics"],
      "double_degrees": []
    },
    {
      "program_name": "Bachelor of Science (Computer Science)",
      "uac_code": "425800",
      "duration_years": 3,
      "lowest_selection_rank": 92.0,
      "lowest_atar": 80.1,
      "portfolio_available": true,
      "assumed_knowledge": "Mathematics Extension 1",
      "description": "Develop your understanding of the design, construction and use of computer systems. Learn the principles behind computing tools, operating systems, compilers, translators and computer hardware, and put your skills to the test with real-world projects throughout your studies.",
      "career_outcomes": "Digital security, Database development, Game development, Software engineering and development, Systems analysis",
      "majors": [
        "Artificial Intelligence",
        "Computer Networks",
        "Database Systems",
        "Embedded Systems",
        "Programming Languages",
        "Security Engineering"
      ],
      "minors": [
        "Accounting",
        "Finance",
        "Psychology",
        "Information Systems",
        "Mathematics",
        "Marketing"
      ],
      "double_degrees": [
        "Actuarial Studies",
        "Advanced Mathematics (Hons)",
        "Advanced Science (Hons)",
        "Arts",
        "Commerce",
        "Economics",
        "Engineering (Hons)",
        "Fine Arts",
        "Information Systems",
        "Law"
      ]
    },
    {
      "program_name": "Bachelor of Computer Science/Arts",
      "uac_code": "425800",
      "duration_years": 4,
      "lowest_selection_rank": 92.0,
      "lowest_atar": 80.1,
      "portfolio_available": true,
      "assumed_knowledge": "Mathematics Extension 1",
      "description": "Combine your understanding of computing systems with the critical thinking and creativity offered by Arts. Learn core programming, systems design, and software engineering, while building skills in areas like languages, history, politics, or media.",
      "career_outcomes": "Software engineer, Game developer, Systems analyst, Public policy advisor, Digital content strategist",
      "majors": [
        "Artificial Intelligence",
        "Computer Networks",
        "Database Systems",
        "Embedded Systems",
        "Programming Languages",
        "Security Engineering"
      ],
      "minors": [
        "Accounting",
        "Finance",
        "Psychology",
        "Information Systems",
        "Mathematics",
        "Marketing"
      ],
      "double_degrees": []
    },
    {
      "program_name": "Bachelor of Computer Science/Fine Arts (Hons)",
      "uac_code": "425810",
      "duration_years": 4,
      "lowest_selection_rank": 92.0,
      "lowest_atar": 80.1,
      "portfolio_available": true,
      "assumed_knowledge": "Mathematics Extension 1",
      "description": "Blend technical computer science skills with creativity and artistic exploration. Build real-world computing and programming expertise while gaining hands-on experience in animation, music, or visual arts through the Fine Arts (Honours) component.",
      "career_outcomes": "Creative technologist, Multimedia developer, Software engineer, Game designer, Digital artist",
      "majors": [
        "Artificial Intelligence",
        "Computer Networks",
        "Database Systems",
        "Embedded Systems",
        "Programming Languages",
        "Security Engineering"
      ],
      "minors": [
        "Accounting",
        "Finance",
        "Psychology",
        "Information Systems",
        "Mathematics",
        "Marketing"
      ],
      "double_degrees": []
    },
    {
      "program_name": "Bachelor of Computer Science/Science",
      "uac_code": "425800",
      "duration_years": 4,
      "lowest_selection_rank": 92.0,
      "lowest_atar": 80.1,
      "portfolio_available": true,
      "assumed_knowledge": "Mathematics Extension 1",
      "description": "Strengthen your problem-solving and technical expertise by combining computer science with a foundation in scientific disciplines. This double degree equips you for complex, cross-disciplinary roles in emerging technology and research fields.",
      "career_outcomes": "Scientific software engineer, Data analyst, Research programmer, Systems developer, Bioinformatics specialist",
      "majors": [
        "Artificial Intelligence",
        "Computer Networks",
        "Database Systems",
        "Embedded Systems",
        "Programming Languages",
        "Security Engineering"
      ],
      "minors": [
        "Accounting",
        "Finance",
        "Psychology",
        "Information Systems",
        "Mathematics",
        "Marketing"
      ],
      "double_degrees": []
    },
    {
      "program_name": "Bachelor of Cyber Security (Sydney)",
      "uac_code": "425860",
      "duration_years": 3,
      "lowest_selection_rank": 92.0,
      "lowest_atar": 82.55,
      "portfolio_available": true,
      "assumed_knowledge": "Mathematics Extension 1",
      "description": "Learn to solve real-world cyber security challenges and hone your skills and knowledge in computer science, information systems, social science and project management. You’ll be equipped to respond to the security needs of government and industry within this rapidly changing sector.",
      "career_outcomes": "App developer, Cyber security analyst, Ethical hacker, Penetration tester, Security consultant, Source code auditor, Vulnerability assessor",
      "majors": [],
      "minors": [],
      "double_degrees": []
    },
    {
      "program_name": "Bachelor of Engineering (Honours) (Flexible First Year)",
      "uac_code": "425000",
      "duration_years": 4,
      "lowest_selection_rank": 92.0,
      "lowest_atar": 80.4,
      "portfolio_available": true,
      "assumed_knowledge": "Mathematics Extension 1, Physics",
      "description": "Bring your ideas to life and learn to tackle technical challenges through a combination of mathematics, natural sciences and computing. This stream allows you to complete core courses and explore electives before choosing your engineering specialisation in your second year.",
      "career_outcomes": "Dependent on chosen specialisation; graduates may work as engineers in civil, electrical, mechanical, software, or other fields",
      "majors": [],
      "minors": [],
      "double_degrees": []
    },
    {
      "program_name": "Bachelor of Aerospace Engineering (Honours)",
      "uac_code": "425050",
      "duration_years": 4,
      "lowest_selection_rank": 92.0,
      "lowest_atar": 80.65,
      "portfolio_available": true,
      "assumed_knowledge": "Chemistry, Mathematics Extension 1",
      "description": "Immerse yourself in the science and practice of air and space flight. Learn how to design, operate and analyse air and space vehicles as you develop specialised skills in aerodynamics, flight mechanics, propulsion and spacecraft.",
      "career_outcomes": "Aerospace engineer, Propulsion engineer, Flight systems analyst, Space industry specialist, National security engineer, Transportation consultant, Maritime construction engineer",
      "majors": [],
      "minors": ["Nuclear Engineering"],
      "double_degrees": []
    },
    {
      "program_name": "Bachelor of Bioinformatics Engineering (Honours)",
      "uac_code": "425770",
      "duration_years": 4,
      "lowest_selection_rank": 92.0,
      "lowest_atar": 84.8,
      "portfolio_available": true,
      "assumed_knowledge": "Chemistry, Mathematics Extension 1",
      "description": "Master the foundations of bioinformatics, a field at the intersection of computing and life sciences. You’ll gain the skills to develop technologies for storing, extracting, organising and interpreting vast amounts of genetic information.",
      "career_outcomes": "Bioinformatics specialist, Pharmaceutical technologist, Agritech developer, Financial analyst in biotech, Big data engineer, Software engineer, Consultant in computational biology",
      "majors": [],
      "minors": [],
      "double_degrees": []
    },
  {
    "program_name": "Bachelor of Biomedical Engineering (Honours)",
    "uac_code": "425040",
    "duration_years": 4,
    "lowest_selection_rank": null,
    "lowest_atar": null,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics, Biology recommended",
    "description": "Play a transformative role in the future of healthcare. Combining engineering expertise with a deep understanding of biology and medicine, this program empowers you to design cutting-edge solutions to medical challenges. Whether by developing life-saving devices or enhancing robotic surgery, you’ll gain the skills to drive progress in the medical field.",
    "career_outcomes": "Medical device design, Robotic surgery, Imaging technologies, Biomedical research, Healthcare manufacturing, Government health innovation",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Chemical Engineering (Honours)",
    "uac_code": "425550",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.15,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Chemistry, Physics",
    "description": "This broad degree bridges the study of the chemical and physical sciences with engineering. You’ll learn to design and optimise the systems used in chemical, industrial and biological processes, producing materials including fuels, fertilisers, wine and pharmaceuticals.",
    "career_outcomes": "Food and drink development, Environmental management, Mining and minerals, Oil and gas, Packaging, Water treatment, Recycling",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Chemical Product Engineering (Honours)",
    "uac_code": "425550",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.15,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Chemistry, Physics",
    "description": "Build the technical and entrepreneurial skills to innovate and develop new chemical and consumer products. You’ll master the development process from start to finish, test new product ideas and extrapolate small-scale chemistry into industrial-scale production.",
    "career_outcomes": "Materials engineer, Chemist, Food and wine scientist, Production manager, Plant engineer, Product tester, R&D manager",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Civil Engineering (Honours)",
    "uac_code": "425400",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.35,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Become a leader in the design, construction and management of sustainable modern infrastructure. Gain the technical skills and practical field experience to shape everything from roads and railways to water management facilities and humanitarian engineering initiatives.",
    "career_outcomes": "Consulting engineer, Construction manager, Government infrastructure planner, Project engineer, Transport engineer, Water systems engineer",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Environmental Engineering (Honours)",
    "uac_code": "425470",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.3,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Learn to identify, resolve and mitigate environmental impacts caused by engineering projects. Collaborate with biologists, ecologists, geologists and engineers to improve environmental outcomes in both local and global contexts.",
    "career_outcomes": "Environmental consultant, Sustainability engineer, Water resource engineer, Environmental impact assessor, Waste management engineer",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Computer Engineering (Honours)",
    "uac_code": "425700",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 82.75,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Learn to design, construct and maintain hardware and software components within computer systems. Gain foundational knowledge in both computer science and electronic engineering to build systems from embedded devices to intelligent hardware platforms.",
    "career_outcomes": "Hardware engineer, Embedded systems developer, Network architect, Systems engineer, Electronics design engineer, Firmware developer",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Geoenergy & Geostorage Engineering (Honours)",
    "uac_code": "425030",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 90.55,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Gain the skills and practical training to lead the global energy transition. Study an industry-aligned curriculum that combines petroleum engineering and renewable energy solutions, learning to extract geothermal energy, store harmful substances and harness future renewable energy sources like hydrogen.",
    "career_outcomes": "Carbon capture and storage, Subsurface resource management, Environmental consulting, Energy system analysis, Renewable energy planning, Geological engineering",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },

  {
    "program_name": "Bachelor of Electrical Engineering (Honours)",
    "uac_code": "425100",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.15,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Learn to design, develop and manage devices and systems using electricity and electronics. Graduate ready to develop new technologies and improve existing systems to enhance efficiency and performance. Led by industry leaders, you’ll gain expertise across telecommunications, photonics, signal processing, wireless networks and more.",
    "career_outcomes": "Electronics, Quantum computing, Networking, Power distribution, Robotics, Signal processing",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Mechanical Engineering (Honours)",
    "uac_code": "425050",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.65,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Gain advanced scientific and engineering expertise as you learn to design and produce technologies that solve society’s biggest problems. You’ll build foundational knowledge in composite structures, fluid dynamics, CAD and CAM software and thermodynamics, allowing you to engineer technologies and products ranging from small sensors to vehicles.",
    "career_outcomes": "Automotive, Biomechanics, Manufacturing, Robotics, Mechanical design, Industrial systems",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Mechanical and Manufacturing Engineering (Honours)",
    "uac_code": "425050",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.65,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Develop a sought-after combination of scientific and engineering knowledge as you learn to design commercially viable products and the machines that create them. Develop the skills to research, build and maintain equipment across a variety of industries, from power plants and renewable energy systems to robots and cars.",
    "career_outcomes": "Automotive, Aerospace, Defence, Insurance, Power generation, Transport",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Mining Engineering (Honours)",
    "uac_code": "425300",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 83.05,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Learn how to safely and responsibly extract minerals that are crucial to the development of modern technologies, including clean energy solutions. You’ll build foundational engineering knowledge alongside mining-specific expertise in geomechanics, ventilation, mine planning and minerals processing.",
    "career_outcomes": "Drilling engineer, Mine planning engineer, Consultant, Project manager, R&D engineer, Regulatory analyst",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Photovoltaics and Solar Energy (Honours)",
    "uac_code": "425200",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 84.2,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Immerse yourself in the manufacture and use of solar cells that capture and convert sunlight into electricity. Study technology development, manufacturing, quality control, reliability, policy and system design, and build practical skills through 60 days of industrial training.",
    "career_outcomes": "Solar cell manufacturing, Quality control, System implementation, Energy policy, Sustainability roles",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Quantum Engineering (Honours)",
    "uac_code": "425100",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.15,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Study the first undergraduate Quantum Engineering degree in the world. Develop foundational knowledge in microelectronics, microwave and telecommunications, and learn how to work with a range of quantum systems, from high-frequency signals to very small electronic circuits.",
    "career_outcomes": "Quantum hardware engineer, Quantum software engineer, Microwave systems designer, Microelectronics engineer, Roles at Microsoft, IBM, and quantum start-ups",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Software Engineering (Honours)",
    "uac_code": "425750",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.25,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1",
    "description": "Become an expert in creating high-quality, reliable software systems. Gain foundational knowledge in computing, software development and system design, and get hands-on experience through team-based projects.",
    "career_outcomes": "Software engineer, Big data engineer, Security engineer, Defence systems developer, Telecommunications developer, Banking software engineer, Health informatics engineer",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Renewable Energy Engineering (Honours)",
    "uac_code": "425200",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 84.2,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Discover how to utilise and capitalise on renewable energy technologies including solar thermal systems, photovoltaics, wind and biomass. Explore key areas such as biomass, photovoltaics, tidal and wave energy, and solar architecture, and apply your learning to real-world projects.",
    "career_outcomes": "Renewable energy engineer, Sustainability consultant, Solar systems engineer, Wind energy analyst, Biomass systems developer, Researcher in clean energy",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Surveying (Honours)",
    "uac_code": "425500",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.5,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1",
    "description": "Surveyors provide critical support to construction, infrastructure, mining and other building projects. Learn to define boundaries, harness digital mapping software and create 3D models of the built and natural environment.",
    "career_outcomes": "Mining surveyor, Cadastral surveyor, Hydrographic surveyor, Photogrammetric surveyor, Infrastructure mapping specialist, Geospatial analyst",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Robotics & Mechatronics Engineering (Honours)",
    "uac_code": "425020",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 81.4,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Understand the full spectrum of smart machine design. You’ll develop valuable skills in autonomous system development, such as self-operating robots and vehicles, and a thorough knowledge of industrial automation. Study key areas, such as control systems, electronics, mechanical design and robotics.",
    "career_outcomes": "Automation engineer, Mechatronics engineer, Robotics systems developer, Aerospace systems engineer, Defence robotics engineer, Mining robotics specialist, Agricultural automation engineer",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Telecommunications Engineering (Honours)",
    "uac_code": "425100",
    "duration_years": 4,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.15,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Explore the theory and application of a broad range of telecommunications systems, such as telephone and data networks, radio and TV, satellites and deep space applications. Learn to design, develop and maintain the transmission of information using different methods across the world.",
    "career_outcomes": "Telecommunications engineer, Satellite communications engineer, RF systems developer, Network architect, Mobile communications engineer, Deep space network engineer",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },

  {
    "program_name": "Bachelor of Engineering (Honours)/Bachelor of Arts",
    "uac_code": "425850",
    "duration_years": 5.7,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.4,
    "assumed_knowledge": ["Mathematics Extension 1", "Physics"],
    "portfolio": true,
    "description": "This flexible dual degree combines the technical expertise of engineering with the critical thinking, communication, and cultural understanding gained through an Arts education. It’s ideal for students seeking to pair analytical skills with a broader social, political, or linguistic context to become well-rounded professionals.",
    "career_outcomes": [
      "Policy advisor with engineering focus",
      "International development engineer",
      "Technical writer or editor",
      "Engineering consultant",
      "Public sector engineer",
      "STEM education or advocacy specialist",
      "Cross-disciplinary project manager"
    ],
    "majors": [
      "Aerospace Engineering",
      "Bioinformatics Engineering",
      "Biomedical Engineering",
      "Chemical Engineering",
      "Chemical Product Engineering",
      "Civil Engineering",
      "Computer Engineering",
      "Electrical Engineering",
      "Environmental Engineering",
      "Geospatial Engineering",
      "Mechanical Engineering",
      "Mechatronic Engineering",
      "Mining Engineering",
      "Petroleum Engineering",
      "Photovoltaics and Solar Energy",
      "Renewable Energy Engineering",
      "Software Engineering",
      "Surveying",
      "Telecommunications",
      "Quantum Engineering",
      "International Relations",
      "Politics and International Affairs",
      "Philosophy",
      "Sociology and Anthropology",
      "Creative Writing",
      "History",
      "Languages (e.g., French, Chinese, Spanish)",
      "Media, Culture and Technology"
    ],
    "double_degrees": []
  },

  {
    "program_name": "Bachelor of Civil Engineering with Architecture (Honours)",
    "uac_code": "425450",
    "duration_years": 4,
    "lowest_selection_rank": 94.0,
    "lowest_atar": 85.05,
    "portfolio_available": false,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Combine conceptual thinking with a hybrid of aesthetic and structural expertise. Pairing civil engineering with a foundation in architectural principles will allow you to develop a holistic understanding of building and design, so you can effectively collaborate to deliver projects that balance functionality and style.",
    "career_outcomes": "Airport and harbour authorities, Construction and contracting companies, Federal, state and local government organisations, Financial organisations, Management consultancies, Specialist structural engineering consultants, Project developers",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Engineering (Honours)/Bachelor of Commerce",
    "uac_code": "425900",
    "duration_years": 5.7,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.35,
    "assumed_knowledge": ["Mathematics Extension 1", "Physics"],
    "portfolio": true,
    "description": "Combine the problem-solving and analytical skills of engineering with the business acumen of commerce. This flexible dual degree equips students to work across industries, integrating technical expertise with commercial strategy. Students benefit from a flexible first year and a wide range of engineering and business specialisations.",
    "career_outcomes": [
      "Project manager",
      "Product development lead",
      "Management consultant",
      "Engineering economist",
      "Operations manager",
      "Business analyst",
      "Financial or strategy consultant"
    ],
    "majors": [
      "Aerospace Engineering",
      "Bioinformatics Engineering",
      "Biomedical Engineering",
      "Chemical Engineering",
      "Chemical Product Engineering",
      "Civil Engineering",
      "Computer Engineering",
      "Electrical Engineering",
      "Environmental Engineering",
      "Geospatial Engineering",
      "Mechanical Engineering",
      "Mechatronic Engineering",
      "Mining Engineering",
      "Petroleum Engineering",
      "Photovoltaics and Solar Energy",
      "Renewable Energy Engineering",
      "Software Engineering",
      "Surveying",
      "Telecommunications",
      "Quantum Engineering",
      "Accounting",
      "Finance",
      "Marketing",
      "Business Economics",
      "Information Systems",
      "International Business",
      "Human Resource Management"
    ],
    "double_degrees": []
  },

  {
    "program_name": "Bachelor of Engineering (Honours)/Bachelor of Engineering Science",
    "uac_code": "425401",
    "duration_years": 5,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.6,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Gain expertise in two complementary areas, combining the practical experience of a Bachelor of Engineering (Honours) with the specialised knowledge of a Bachelor of Engineering Science. With the highest number of engineering specialisations in Australia and a flexible first year, this program will help you find your passion and excel in a multidisciplinary environment.",
    "career_outcomes": "Chemical engineer, Civil engineer, Electrical engineer, Environmental engineer, Mechatronic engineer, Mining engineer, Petroleum engineer, Photovoltaics and solar energy engineer, Renewable energy engineer, Mechanical engineer",
    "majors": [
      "Chemical Engineering",
      "Civil Engineering",
      "Electrical Engineering",
      "Environmental Engineering",
      "Mechatronic Engineering",
      "Mining Engineering",
      "Petroleum Engineering",
      "Photovoltaics and Solar Energy",
      "Renewable Energy Engineering",
      "Mechanical Engineering"
    ],
    "minors": [],
    "double_degrees": []
  },

  {
    "program_name": "Bachelor of Engineering (Honours)/Bachelor of Computer Science",
    "uac_code": "425850",
    "duration_years": 5,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.35,
    "assumed_knowledge": ["Mathematics Extension 1", "Physics"],
    "portfolio": true,
    "description": "This double degree combines deep technical engineering knowledge with advanced computer science skills. Ideal for students looking to develop next-generation technologies or work at the interface of hardware and software, this program opens career pathways in AI, embedded systems, networking, and digital systems engineering.",
    "career_outcomes": [
      "Embedded systems engineer",
      "Full-stack developer",
      "Software engineer",
      "Hardware/software integration specialist",
      "Systems architect",
      "AI/ML engineer",
      "IoT engineer"
    ],
    "majors": [
      "Aerospace Engineering",
      "Bioinformatics Engineering",
      "Biomedical Engineering",
      "Chemical Engineering",
      "Chemical Product Engineering",
      "Civil Engineering",
      "Computer Engineering",
      "Electrical Engineering",
      "Environmental Engineering",
      "Geospatial Engineering",
      "Mechanical Engineering",
      "Mechatronic Engineering",
      "Mining Engineering",
      "Petroleum Engineering",
      "Photovoltaics and Solar Energy",
      "Renewable Energy Engineering",
      "Software Engineering",
      "Surveying",
      "Telecommunications",
      "Quantum Engineering",
      "Artificial Intelligence",
      "Computer Systems",
      "Database Systems",
      "Embedded Systems",
      "Security Engineering"
    ],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Engineering (Honours)/Master of Biomedical Engineering",
    "uac_code": "425950",
    "duration_years": 5,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.5,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics Extension 1 and Physics. See also: assumed knowledge for chosen Bachelor of Engineering (Honours) specialisation",
    "description": "Learn to design, build and implement new solutions across the vast field of engineering. This double degree allows you to gain a solid engineering background in mathematics, natural sciences and computing, and examine the development of healthcare solutions such as bionics, prosthetics and robotic surgery.",
    "career_outcomes": "Biotechnology, Cell and tissue engineering, Medical device manufacturing, Orthopaedic devices, Pharmaceuticals, Robotic surgery, Scientific research",
    "majors": [
      "Bioinformatics Engineering",
      "Chemical Engineering",
      "Computer Engineering",
      "Electrical Engineering",
      "Mechanical Engineering",
      "Mechatronic Engineering",
      "Software Engineering",
      "Telecommunications"
    ],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Engineering (Honours)/Bachelor of Science",
    "uac_code": "425850",
    "duration_years": 5.0,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.4,
    "assumed_knowledge": ["Mathematics Extension 1", "Physics"],
    "portfolio": true,
    "description": "Combine engineering knowledge with scientific enquiry through this flexible dual degree. Gain technical expertise across a range of engineering disciplines while exploring scientific fields such as physics, chemistry, biology, mathematics, and data science. This degree is ideal for students wanting to bridge engineering practice with scientific innovation.",
    "career_outcomes": [
      "Engineering researcher",
      "Data scientist",
      "Materials scientist",
      "Product development engineer",
      "Environmental consultant",
      "Biotech analyst",
      "Technical consultant"
    ],
    "majors": [
      "Aerospace Engineering",
      "Bioinformatics Engineering",
      "Biomedical Engineering",
      "Chemical Engineering",
      "Chemical Product Engineering",
      "Civil Engineering",
      "Computer Engineering",
      "Electrical Engineering",
      "Environmental Engineering",
      "Geospatial Engineering",
      "Mechanical Engineering",
      "Mechatronic Engineering",
      "Mining Engineering",
      "Petroleum Engineering",
      "Photovoltaics and Solar Energy",
      "Renewable Energy Engineering",
      "Software Engineering",
      "Surveying",
      "Telecommunications",
      "Quantum Engineering",
      "Biology",
      "Physics",
      "Chemistry",
      "Mathematics",
      "Statistics",
      "Earth Science",
      "Psychology",
      "Data Science"
    ],
    "double_degrees": []
  },

  {
    "program_name": "Bachelor of Engineering (Honours) (Civil)/Bachelor of Surveying",
    "uac_code": "425402",
    "duration_years": 5.0,
    "lowest_selection_rank": 92.0,
    "lowest_atar": 80.5,
    "assumed_knowledge": ["Mathematics Extension 1", "Physics"],
    "portfolio": true,
    "description": "This unique dual degree prepares students to tackle both civil infrastructure development and precise spatial measurement. The combination of civil engineering and surveying offers a broad skill set that enables graduates to lead major construction and infrastructure projects with deep spatial awareness and technical accuracy.",
    "career_outcomes": [
      "Civil engineer",
      "Structural engineer",
      "Surveyor",
      "Geospatial analyst",
      "Infrastructure project manager",
      "Cadastral or hydrographic surveyor",
      "Urban development planner"
    ],
    "majors": [
      "Civil Engineering",
      "Structural Engineering",
      "Environmental Engineering",
      "Construction Engineering",
      "Surveying",
      "Geospatial Engineering"
    ],
    "double_degrees": []
  },

  {
    "program_name": "Bachelor of Engineering (Honours)/Master of Engineering (Electrical Engineering)",
    "uac_code": "425150",
    "duration_years": 5,
    "lowest_selection_rank": 94.0,
    "lowest_atar": 87.0,
    "portfolio_available": false,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Develop advanced electrical engineering expertise with a unique dual degree from Australia’s #1 faculty for Electrical Engineering. This hands-on program helps you build your creative problem-solving, analytical and critical thinking, and interpersonal communication skills through immersive learning and real-world projects.",
    "career_outcomes": "Electronics, networking and computing, Energy, Infrastructure, New technologies and products, Transport manufacture",
    "majors": [
      "Electrical Engineering"
    ],
    "minors": [
      "Accounting",
      "Business Economics",
      "Computing",
      "Finance",
      "Human Resource Management",
      "International Business",
      "Internet of Things",
      "Management",
      "Marketing",
      "Photovoltaics"
    ],
    "double_degrees": []
  },
  {
    "program_name": "Bachelor of Food Science (Honours)",
    "uac_code": "425600",
    "duration_years": 4,
    "lowest_selection_rank": 85.0,
    "lowest_atar": 75.0,
    "portfolio_available": true,
    "assumed_knowledge": "Mathematics (2 unit), Chemistry",
    "description": "Address global food challenges or innovate new products through mathematics, natural science and applied science. You’ll engage in food product design and enquiry projects, professional food practice and food systems management – specialising in your choice of technology or nutrition.",
    "career_outcomes": "Dietetics, Food technology, Production and laboratory management, Product development, Product testing, Quality assurance, Safety inspection",
    "majors": [
      "Food Science and Nutrition",
      "Food Science and Technology"
    ],
    "minors": [
      "Humanitarian Science and Technology"
    ],
    "double_degrees": []
  },
  {
    "program_name": "Undergraduate Certificate in Engineering",
    "uac_code": "425960",
    "duration_years": 0.7,
    "lowest_selection_rank": 85.0,
    "lowest_atar": 84.65,
    "portfolio_available": false,
    "assumed_knowledge": "Mathematics Extension 1, Physics",
    "description": "Learn about the fundamentals of engineering practice – including engineering design, computing and maths – with access to the latest technology. Apply your knowledge and solve basic engineering problems with practical, hands-on learning.",
    "career_outcomes": "Pathway to Bachelor of Engineering (Honours) upon meeting articulation requirements",
    "majors": [],
    "minors": [],
    "double_degrees": []
  },
  {
    "program_name": "Undergraduate Certificate in Computer Science",
    "uac_code": "425970",
    "duration_years": 0.7,
    "lowest_selection_rank": 85.0,
    "lowest_atar": 78.5,
    "portfolio_available": false,
    "assumed_knowledge": "Mathematics Extension 1",
    "description": "Develop fundamental knowledge in computer science, programming and mathematics through practical, hands-on learning. Upon completion and meeting articulation requirements, students may transfer to a Bachelor of Computer Science.",
    "career_outcomes": "Pathway to Bachelor of Computer Science upon meeting articulation requirements",
    "majors": [],
    "minors": [],
    "double_degrees": []
  }

]

